-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1:3306
-- 產生時間： 2022-10-04 00:37:15
-- 伺服器版本： 5.7.36
-- PHP 版本： 7.4.26

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫: `funmovie`
--

-- --------------------------------------------------------

--
-- 資料表結構 `a_user`
--

DROP TABLE IF EXISTS `a_user`;
CREATE TABLE IF NOT EXISTS `a_user` (
  `ID` int(11) NOT NULL AUTO_INCREMENT,
  `Email_User` varchar(32) COLLATE utf8_unicode_ci NOT NULL COMMENT '信箱/帳號',
  `Password` varchar(32) COLLATE utf8_unicode_ci NOT NULL COMMENT '密碼',
  `Nickname` varchar(32) COLLATE utf8_unicode_ci NOT NULL COMMENT '暱稱',
  `Birth` varchar(32) COLLATE utf8_unicode_ci NOT NULL COMMENT '生日',
  `Sex` varchar(32) COLLATE utf8_unicode_ci NOT NULL COMMENT '性別',
  `Area` varchar(32) COLLATE utf8_unicode_ci NOT NULL COMMENT '居住縣市',
  `Phone` varchar(32) COLLATE utf8_unicode_ci NOT NULL COMMENT '手機',
  `Source` varchar(32) COLLATE utf8_unicode_ci NOT NULL COMMENT '得知網站來源\r\n親朋好友/網路搜尋/社群媒體/電視/廣告看板/其他(字數1~8)',
  `Level` int(11) NOT NULL COMMENT '方案/會員等級\r\n一般會員:0\r\n黃金會員:1\r\n鑽石會員:2',
  `How_Pay` varchar(32) COLLATE utf8_unicode_ci NOT NULL COMMENT '支付方式: 信用卡/行動支付',
  `Feedback` varchar(32) COLLATE utf8_unicode_ci DEFAULT NULL COMMENT '意見回饋',
  `UID` varchar(32) COLLATE utf8_unicode_ci DEFAULT NULL COMMENT 'UID',
  `Order_Time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '購買時間',
  `Love` varchar(32) COLLATE utf8_unicode_ci NOT NULL,
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM AUTO_INCREMENT=109 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 傾印資料表的資料 `a_user`
--

INSERT INTO `a_user` (`ID`, `Email_User`, `Password`, `Nickname`, `Birth`, `Sex`, `Area`, `Phone`, `Source`, `Level`, `How_Pay`, `Feedback`, `UID`, `Order_Time`, `Love`) VALUES
(1, 'Ray@gmail.com', '33333', '阿Ray', '1998-04-25', '男', '桃園市', '0910555666', '親友', 2, '行動支付', NULL, '04c0630', '2022-07-26 06:45:38', '1/3/4'),
(2, 'May@gmail.com', '22222', '阿May', '2022.1.1', '女', '新北市', '0910555666', '網路搜尋', 1, '行動支付', NULL, 'e69b0a4', '2022-07-26 07:11:23', ''),
(3, 'Peter@gmail', '111111', '阿P', '2022.1.1', '男', '宜蘭縣', '0910333222', '親朋好友', 0, '信用卡支付', NULL, '3ce193a', '2022-07-26 07:11:23', ''),
(4, 'Jay@gmail.com', '22222', '阿J', '2020.1.1', '男', '新竹市', '0910333111', '電視', 2, '行動支付', NULL, '6f87da3', '2022-07-26 07:16:07', ''),
(5, 'Susan@gmail.com', '22222', 'S姊', '20201.1', '女', '台中市', '915333222', '廣告看板', 1, '行動支付', NULL, '0a98a3a', '2022-07-26 07:16:07', ''),
(6, 'jane@hotmail.com', '22222', '阿Jane', '2022-08-17', '女', '新竹市', '0915222555', '電視', 2, '信用卡支付', NULL, '7a4ef3d', '2022-08-05 11:55:20', '1/3'),
(89, '123456', '1111', 'TT', '2020-04-01', '女', '臺中市', '123456', '網路搜尋', 2, '行動支付', NULL, '3d34c2c', '2022-08-29 00:26:55', '2/3'),
(95, 'noah111', 'noah111', 'noah', '1997-01-21', '男', '臺中市', '0912345678', '親朋好友', 0, '行動支付', NULL, 'cc4818d', '2022-09-07 13:50:19', '1/3'),
(106, '0000', '0000', '0000', '2022-09-11', '女', '新竹市', '0000', '網路搜尋', 2, '信用卡支付', NULL, 'c6e4188', '2022-09-28 05:46:31', '2/3'),
(102, 'A001', '123456', '美枒', '2022-09-01', '女', '嘉義市', '0910123456', '電視廣告', 1, '行動支付', NULL, 'c7ef180', '2022-09-20 02:52:59', '1/2/3'),
(103, '0001', '0001', '0001', '2022-09-07', '女', '基隆市', '0001', '網路搜尋', 2, '行動支付', NULL, 'ea4f73e', '2022-09-20 03:03:30', '2/3'),
(104, 'aaaa', 'aaaa', 'aaaa', '2022-09-16', '男', '新竹縣', '0321', '社群媒體', 2, '行動支付', NULL, '845933c', '2022-09-23 08:08:23', '1/2/4'),
(105, 'awei', '9999', 'awei', '1997-04-01', '男', '臺中市', '0988339336', '親朋好友', 2, '信用卡支付', NULL, 'a4dd7cf', '2022-09-27 05:41:46', '1/2/3'),
(107, 'ccc1119', 'miss2417', 'tila', '2022-03-24', '男', '雲林縣', '0912399869', '網路搜尋', 2, '行動支付', NULL, '6cdc4c6', '2022-09-28 05:48:26', '1/2/3'),
(108, 'owner', '@demouser', 'Richie', '2022/01/01', '男', '台中市', '09xxxxxxxx', '親朋好友', 2, '信用卡支付', NULL, '807dec9', '2022-10-03 08:35:40', '1/2/3/4');

-- --------------------------------------------------------

--
-- 資料表結構 `a_user_recent`
--

DROP TABLE IF EXISTS `a_user_recent`;
CREATE TABLE IF NOT EXISTS `a_user_recent` (
  `ID` int(11) NOT NULL AUTO_INCREMENT,
  `M_ID` int(11) NOT NULL,
  `Recent` int(11) NOT NULL,
  `Time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM AUTO_INCREMENT=51 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 傾印資料表的資料 `a_user_recent`
--

INSERT INTO `a_user_recent` (`ID`, `M_ID`, `Recent`, `Time`) VALUES
(1, 1, 112, '2022-10-02 11:28:08'),
(2, 1, 130, '2022-10-03 07:39:29'),
(4, 1, 7, '2022-10-03 07:39:08'),
(5, 2, 8, '2022-08-27 04:22:14'),
(6, 2, 3, '2022-08-27 04:22:14'),
(7, 2, 4, '2022-08-27 04:22:14'),
(8, 2, 6, '2022-08-27 04:22:14'),
(9, 2, 11, '2022-08-27 04:22:14'),
(10, 3, 1, '2022-08-27 04:22:14'),
(11, 3, 2, '2022-08-27 04:22:14'),
(12, 3, 3, '2022-08-27 04:22:14'),
(13, 3, 4, '2022-08-27 04:22:14'),
(14, 3, 7, '2022-08-27 04:22:14'),
(15, 4, 2, '2022-08-27 04:22:14'),
(16, 1, 1, '2022-10-02 11:28:18'),
(17, 1, 95, '2022-10-02 11:28:23'),
(18, 1, 21, '2022-10-03 07:38:41'),
(19, 1, 103, '2022-10-03 07:41:28'),
(20, 1, 104, '2022-10-02 11:30:10'),
(21, 1, 10, '2022-10-03 07:39:11'),
(22, 1, 119, '2022-10-02 11:29:51'),
(23, 89, 19, '2022-09-27 04:40:44'),
(24, 89, 2, '2022-09-06 01:05:41'),
(25, 89, 4, '2022-09-06 02:07:40'),
(26, 89, 21, '2022-09-27 04:40:14'),
(27, 89, 22, '2022-09-27 04:37:43'),
(28, 89, 96, '2022-09-27 04:37:39'),
(29, 89, 120, '2022-09-27 04:40:26'),
(30, 100, 22, '2022-09-08 05:57:13'),
(31, 89, 20, '2022-09-27 04:37:36'),
(32, 102, 43, '2022-09-21 08:36:53'),
(33, 102, 40, '2022-09-21 08:36:56'),
(34, 102, 108, '2022-09-21 08:37:06'),
(35, 102, 118, '2022-09-21 08:37:17'),
(36, 102, 115, '2022-09-21 08:37:11'),
(37, 102, 39, '2022-09-21 08:36:49'),
(38, 102, 116, '2022-09-21 08:37:14'),
(39, 102, 37, '2022-09-21 08:36:47'),
(40, 102, 39, '2022-09-21 08:36:49'),
(41, 102, 42, '2022-09-21 08:36:52'),
(42, 104, 112, '2022-09-23 08:22:48'),
(43, 104, 21, '2022-09-23 08:22:59'),
(44, 101, 120, '2022-09-27 16:33:58'),
(45, 101, 112, '2022-09-27 16:34:02'),
(46, 89, 98, '2022-09-28 05:13:40'),
(47, 107, 2, '2022-09-28 05:49:51'),
(48, 107, 21, '2022-09-28 05:50:41'),
(49, 107, 23, '2022-09-28 05:50:52'),
(50, 5, 120, '2022-09-29 00:43:38');

-- --------------------------------------------------------

--
-- 資料表結構 `a_user_save`
--

DROP TABLE IF EXISTS `a_user_save`;
CREATE TABLE IF NOT EXISTS `a_user_save` (
  `ID` int(11) NOT NULL AUTO_INCREMENT,
  `M_ID` int(11) NOT NULL,
  `Save` int(11) NOT NULL,
  `Time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM AUTO_INCREMENT=94 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 傾印資料表的資料 `a_user_save`
--

INSERT INTO `a_user_save` (`ID`, `M_ID`, `Save`, `Time`) VALUES
(5, 2, 8, '2022-08-27 08:41:28'),
(6, 2, 3, '2022-08-27 08:41:28'),
(7, 2, 4, '2022-08-27 08:41:28'),
(8, 2, 6, '2022-08-27 08:41:28'),
(9, 2, 11, '2022-08-27 08:41:28'),
(10, 3, 1, '2022-08-27 08:41:28'),
(11, 3, 2, '2022-08-27 08:41:28'),
(12, 3, 3, '2022-08-27 08:41:28'),
(13, 3, 4, '2022-08-27 08:41:28'),
(14, 3, 7, '2022-08-27 08:41:28'),
(15, 4, 2, '2022-08-27 08:41:28'),
(26, 89, 2, '2022-09-06 00:57:56'),
(27, 89, 4, '2022-09-06 00:58:26'),
(28, 89, 22, '2022-09-06 02:07:30'),
(30, 89, 21, '2022-09-08 05:05:01'),
(31, 89, 96, '2022-09-08 05:05:07'),
(37, 102, 120, '2022-09-21 01:23:03'),
(38, 102, 22, '2022-09-21 01:23:14'),
(39, 102, 98, '2022-09-21 01:23:22'),
(40, 102, 99, '2022-09-21 01:23:27'),
(41, 102, 19, '2022-09-21 01:23:34'),
(42, 102, 95, '2022-09-21 01:23:45'),
(43, 102, 7, '2022-09-21 01:23:54'),
(44, 102, 4, '2022-09-21 01:23:59'),
(45, 102, 8, '2022-09-21 01:24:05'),
(46, 102, 101, '2022-09-21 01:24:12'),
(47, 102, 27, '2022-09-21 01:24:19'),
(48, 102, 105, '2022-09-21 01:24:28'),
(52, 104, 21, '2022-09-23 08:23:00'),
(58, 1, 122, '2022-09-26 17:31:03'),
(59, 1, 104, '2022-09-26 17:31:08'),
(60, 1, 22, '2022-09-26 17:31:14'),
(61, 1, 134, '2022-09-26 17:32:26'),
(62, 1, 102, '2022-09-27 02:23:47'),
(63, 1, 124, '2022-09-27 02:23:58'),
(64, 1, 123, '2022-09-27 03:03:33'),
(65, 1, 96, '2022-09-27 03:03:50'),
(66, 1, 112, '2022-09-27 03:04:03'),
(67, 89, 120, '2022-09-27 04:37:33'),
(68, 89, 20, '2022-09-27 04:37:37'),
(69, 89, 19, '2022-09-27 04:40:45'),
(70, 1, 5, '2022-09-27 06:26:12'),
(71, 1, 7, '2022-09-27 06:26:20'),
(72, 1, 6, '2022-09-27 06:26:26'),
(73, 1, 98, '2022-09-27 06:26:31'),
(74, 1, 101, '2022-09-27 13:14:10'),
(75, 1, 125, '2022-09-27 13:14:18'),
(76, 1, 95, '2022-09-27 13:14:26'),
(77, 1, 9, '2022-09-27 13:14:38'),
(78, 1, 3, '2022-09-27 13:14:43'),
(79, 1, 127, '2022-09-27 13:14:50'),
(80, 1, 133, '2022-09-27 13:14:58'),
(81, 101, 112, '2022-09-27 16:34:04'),
(82, 107, 2, '2022-09-28 05:50:34'),
(83, 107, 21, '2022-09-28 05:50:43'),
(84, 107, 23, '2022-09-28 05:50:53'),
(85, 1, 21, '2022-09-28 12:41:24'),
(86, 1, 120, '2022-09-28 12:41:32'),
(87, 1, 100, '2022-09-28 12:41:44'),
(88, 1, 121, '2022-09-28 12:41:49'),
(89, 1, 130, '2022-09-28 12:41:57'),
(90, 5, 120, '2022-09-29 00:43:40'),
(91, 1, 1, '2022-10-02 11:18:41'),
(92, 1, 10, '2022-10-03 07:39:14'),
(93, 1, 103, '2022-10-03 07:41:31');

-- --------------------------------------------------------

--
-- 資料表結構 `b_user`
--

DROP TABLE IF EXISTS `b_user`;
CREATE TABLE IF NOT EXISTS `b_user` (
  `ID` int(11) NOT NULL AUTO_INCREMENT,
  `M_ID` int(11) DEFAULT NULL COMMENT '連結主帳',
  `Sub_User` int(11) NOT NULL COMMENT '成員ID',
  `Nickname` varchar(32) COLLATE utf8_unicode_ci NOT NULL COMMENT '暱稱',
  `UID2` varchar(32) COLLATE utf8_unicode_ci DEFAULT NULL,
  `Time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '加入時間',
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM AUTO_INCREMENT=105 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 傾印資料表的資料 `b_user`
--

INSERT INTO `b_user` (`ID`, `M_ID`, `Sub_User`, `Nickname`, `UID2`, `Time`) VALUES
(38, 6, 4, '小黃蜂', '0df1016', '2022-08-12 05:46:45'),
(39, 6, 5, '柯博文', '3e27e80', '2022-08-12 05:46:45'),
(37, 6, 3, '葉問', '6f82fcb', '2022-08-12 05:46:45'),
(35, 6, 1, '皮卡丘', NULL, '2022-08-12 05:46:45'),
(63, 31, 2, '小新', NULL, '2022-08-16 07:51:11'),
(62, 31, 1, '柯南', NULL, '2022-08-16 07:50:36'),
(58, 18, 5, '成龍', NULL, '2022-08-16 06:51:05'),
(65, 1, 2, '大番薯', '1fd19fe', '2022-08-24 07:04:01'),
(66, 33, 1, '1234', NULL, '2022-08-24 07:04:44'),
(67, 33, 2, 'ff', NULL, '2022-08-24 07:30:47'),
(78, 6, 2, '中黃蜂', NULL, '2022-08-27 10:04:07'),
(76, 87, 1, '2222', NULL, '2022-08-26 14:03:07'),
(71, 74, 1, '789987', NULL, '2022-08-25 07:08:14'),
(77, 87, 2, '3333', NULL, '2022-08-26 14:03:26'),
(73, 74, 3, '789', NULL, '2022-08-25 07:09:09'),
(74, 76, 1, '10101010', NULL, '2022-08-25 07:09:36'),
(79, 89, 1, '203', 'adda210', '2022-08-30 05:07:56'),
(98, 105, 1, '貓貓', NULL, '2022-09-27 05:42:31'),
(81, 1, 1, '魯夫', '6092f11', '2022-09-13 03:05:48'),
(82, 1, 3, '羅賓', NULL, '2022-09-13 03:06:16'),
(84, 102, 1, '野原廣志', NULL, '2022-09-20 05:09:41'),
(85, 102, 2, '野原新之助', NULL, '2022-09-20 05:10:22'),
(86, 102, 3, '小葵', NULL, '2022-09-20 05:10:51'),
(99, 105, 2, '狗狗', NULL, '2022-09-27 05:42:45'),
(100, 102, 5, '987', NULL, '2022-09-27 08:27:13'),
(89, 1, 4, '鳳梨', NULL, '2022-09-22 00:24:09'),
(96, 104, 3, '02', NULL, '2022-09-23 08:14:02'),
(91, 1, 5, '桌子', NULL, '2022-09-22 07:46:50'),
(94, 104, 1, '01', NULL, '2022-09-23 08:13:43'),
(97, 102, 4, '~小白~', NULL, '2022-09-27 03:06:58'),
(101, 89, 2, '023', NULL, '2022-09-28 00:43:58'),
(104, 107, 1, 'hito', NULL, '2022-09-28 05:52:08'),
(103, 106, 1, '0001', NULL, '2022-09-28 05:46:50');

-- --------------------------------------------------------

--
-- 資料表結構 `b_user_recent`
--

DROP TABLE IF EXISTS `b_user_recent`;
CREATE TABLE IF NOT EXISTS `b_user_recent` (
  `ID` int(11) NOT NULL AUTO_INCREMENT,
  `Sub_ID` int(11) NOT NULL,
  `Recent` int(11) DEFAULT NULL,
  `Time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM AUTO_INCREMENT=266 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 傾印資料表的資料 `b_user_recent`
--

INSERT INTO `b_user_recent` (`ID`, `Sub_ID`, `Recent`, `Time`) VALUES
(227, 65, 21, '2022-09-23 08:05:08'),
(226, 65, 6, '2022-09-28 07:52:41'),
(225, 65, 22, '2022-09-14 00:50:37'),
(224, 81, 20, '2022-09-22 00:23:22'),
(223, 81, 5, '2022-09-14 00:46:15'),
(222, 81, 3, '2022-09-14 00:43:20'),
(221, 82, 7, '2022-09-14 14:45:52'),
(220, 82, 5, '2022-09-13 13:48:35'),
(219, 82, 2, '2022-09-14 00:53:55'),
(218, 1, 20, '2022-08-29 03:41:49'),
(228, 65, 5, '2022-10-03 07:42:29'),
(229, 65, 100, '2022-09-14 00:50:42'),
(230, 65, 4, '2022-09-28 07:24:36'),
(231, 65, 8, '2022-10-03 07:42:33'),
(232, 65, 120, '2022-09-28 07:52:37'),
(233, 65, 121, '2022-09-22 07:50:48'),
(234, 65, 99, '2022-09-28 07:24:34'),
(235, 82, 3, '2022-09-14 00:58:52'),
(236, 82, 21, '2022-09-14 00:54:18'),
(237, 81, 97, '2022-09-22 00:23:09'),
(238, 81, 122, '2022-09-13 15:08:11'),
(239, 81, 120, '2022-09-22 00:23:34'),
(240, 81, 119, '2022-09-13 15:08:17'),
(241, 80, 96, '2022-09-14 00:34:57'),
(242, 80, 120, '2022-09-14 00:34:54'),
(243, 80, 21, '2022-09-14 00:34:27'),
(244, 80, 3, '2022-09-14 00:34:31'),
(245, 81, 96, '2022-09-22 00:23:08'),
(246, 81, 23, '2022-09-22 00:23:02'),
(247, 81, 2, '2022-09-14 00:46:13'),
(248, 82, 97, '2022-09-14 00:58:28'),
(249, 82, 95, '2022-09-14 00:53:45'),
(250, 82, 101, '2022-09-14 00:58:31'),
(251, 82, 130, '2022-09-14 00:59:03'),
(252, 82, 99, '2022-09-14 14:45:55'),
(253, 79, 120, '2022-09-15 00:24:26'),
(254, 79, 95, '2022-09-28 07:05:33'),
(255, 79, 3, '2022-09-15 00:24:34'),
(256, 85, 112, '2022-09-22 03:26:56'),
(257, 84, 111, '2022-09-22 03:27:40'),
(258, 84, 120, '2022-09-22 03:27:49'),
(259, 84, 96, '2022-09-22 03:28:57'),
(260, 91, 120, '2022-09-23 08:07:11'),
(261, 91, 20, '2022-09-23 08:08:23'),
(262, 91, 22, '2022-09-23 08:08:27'),
(263, 91, 96, '2022-09-23 08:08:32'),
(264, 94, 5, '2022-09-23 08:24:21'),
(265, 94, 21, '2022-09-23 08:24:27');

-- --------------------------------------------------------

--
-- 資料表結構 `b_user_save`
--

DROP TABLE IF EXISTS `b_user_save`;
CREATE TABLE IF NOT EXISTS `b_user_save` (
  `ID` int(11) NOT NULL AUTO_INCREMENT,
  `Sub_ID` int(11) NOT NULL,
  `Save` int(11) NOT NULL,
  `Time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM AUTO_INCREMENT=89 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 傾印資料表的資料 `b_user_save`
--

INSERT INTO `b_user_save` (`ID`, `Sub_ID`, `Save`, `Time`) VALUES
(1, 82, 6, '2022-09-13 02:50:10'),
(2, 82, 4, '2022-09-13 02:50:10'),
(3, 82, 3, '2022-09-13 02:50:10'),
(4, 82, 10, '2022-09-13 02:50:10'),
(5, 81, 8, '2022-09-13 02:50:10'),
(6, 81, 3, '2022-09-13 02:50:10'),
(7, 81, 4, '2022-09-13 02:50:10'),
(8, 81, 6, '2022-09-13 02:50:10'),
(9, 81, 11, '2022-09-13 02:50:10'),
(11, 56, 2, '2022-09-13 02:50:10'),
(15, 4, 2, '2022-09-13 02:50:10'),
(38, 65, 127, '2022-09-13 12:23:06'),
(39, 65, 25, '2022-09-13 12:23:15'),
(40, 65, 130, '2022-09-13 12:25:04'),
(41, 65, 124, '2022-09-13 12:27:39'),
(42, 65, 129, '2022-09-13 12:28:27'),
(43, 65, 14, '2022-09-13 12:32:00'),
(44, 65, 15, '2022-09-13 12:32:07'),
(45, 65, 17, '2022-09-13 12:32:12'),
(46, 65, 18, '2022-09-13 12:32:16'),
(47, 65, 20, '2022-09-13 12:34:08'),
(48, 65, 3, '2022-09-13 12:34:39'),
(49, 65, 128, '2022-09-13 12:36:40'),
(50, 65, 16, '2022-09-13 12:37:12'),
(51, 65, 134, '2022-09-13 12:38:11'),
(52, 65, 135, '2022-09-13 12:38:17'),
(53, 65, 120, '2022-09-13 12:44:32'),
(54, 65, 95, '2022-09-13 12:45:02'),
(55, 65, 97, '2022-09-13 13:37:28'),
(56, 65, 19, '2022-09-13 13:37:44'),
(57, 65, 4, '2022-09-13 13:38:07'),
(58, 65, 98, '2022-09-13 13:38:40'),
(59, 82, 7, '2022-09-13 15:01:46'),
(62, 81, 96, '2022-09-14 00:43:59'),
(63, 81, 23, '2022-09-14 00:44:20'),
(64, 81, 2, '2022-09-14 00:46:03'),
(65, 81, 5, '2022-09-14 00:46:15'),
(66, 65, 5, '2022-09-14 00:46:36'),
(67, 65, 21, '2022-09-14 00:47:14'),
(68, 65, 22, '2022-09-14 00:47:23'),
(69, 65, 125, '2022-09-14 00:47:43'),
(70, 65, 121, '2022-09-14 00:47:56'),
(71, 65, 6, '2022-09-14 00:49:03'),
(72, 65, 100, '2022-09-14 00:50:42'),
(73, 82, 97, '2022-09-14 00:51:52'),
(74, 82, 95, '2022-09-14 00:53:46'),
(75, 82, 2, '2022-09-14 00:53:56'),
(76, 82, 21, '2022-09-14 00:54:19'),
(77, 82, 101, '2022-09-14 00:58:32'),
(78, 82, 130, '2022-09-14 00:59:04'),
(79, 82, 99, '2022-09-14 14:45:56'),
(80, 79, 120, '2022-09-15 00:24:28'),
(81, 79, 3, '2022-09-15 00:24:35'),
(82, 81, 97, '2022-09-22 00:23:11'),
(83, 81, 20, '2022-09-22 00:23:23'),
(84, 84, 111, '2022-09-22 03:27:42'),
(85, 65, 99, '2022-09-22 07:51:54'),
(86, 91, 120, '2022-09-23 08:07:08'),
(87, 94, 21, '2022-09-23 08:24:28'),
(88, 65, 8, '2022-10-03 07:42:34');

-- --------------------------------------------------------

--
-- 資料表結構 `c_movie`
--

DROP TABLE IF EXISTS `c_movie`;
CREATE TABLE IF NOT EXISTS `c_movie` (
  `Movie_ID` int(11) NOT NULL,
  `Moviename` varchar(32) COLLATE utf8_unicode_ci NOT NULL,
  `Love` varchar(32) COLLATE utf8_unicode_ci NOT NULL,
  `Story` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `Image` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `URL` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `Hot` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 傾印資料表的資料 `c_movie`
--

INSERT INTO `c_movie` (`Movie_ID`, `Moviename`, `Love`, `Story`, `Image`, `URL`, `Hot`) VALUES
(1, '一家之主', '1', '妳在哪裡，家就在那裡...\n在家裡，是稱職的妻子、母親、媳婦與女兒；在外頭，為了賺錢經營了一間美術教室，她是葉蘭心（鮑起靜 飾），每天早上在六點鬧鐘響起前一刻就起床，像陀螺般裡外', '台灣/一家之主.jpg', 'https://www.youtube.com/watch?v=mYRH8e1ui-k', 9),
(2, '女鬼橋', '1', '真實靈異傳說改編夜闖直播意外鬼入鏡轟動全台\n直播意外驚嚇直擊！來自真實傳聞已久的校園靈異傳說─台中東海大學「女鬼橋」，這個東海傳奇在學生間流傳多年，相傳有位女學生被負心男拋棄', '台灣/女鬼橋.jpg', 'https://www.youtube.com/watch?v=mYRH8e2ui-k', 12),
(3, '少年PI的奇幻漂流', '1', '《少年Pi的奇幻漂流》是根據全球暢銷小說家楊〮馬泰爾所撰寫的同名小說改編而成的3D史詩奇幻鉅作，並由奧斯卡獎導演李安親自執導，是敘述一位少年在海上克服一切艱難困境獲得重生的故事。', '台灣/少年PI的奇幻漂流.jpg', 'https://www.youtube.com/watch?v=mYRH8e3ui-k', 28),
(4, '少年仔，安啦！', '1', '故事劇情描寫台灣社會在經濟成長的影響下，呈現出迅速增長的青少年暴力問題。整個舞臺從雲林縣北港鎮朝天宮轉移到台北市萬華區西門町取景，淳樸鄉鎮對比出繁華都市景象，隱喻人心糜爛與價', '台灣/少年仔，安啦！.jpg', 'https://www.youtube.com/watch?v=mYRH8e4ui-k', 18),
(5, '月老', '1', '慘遭雷擊而死的阿綸（柯震東 飾）來到陰間，生前所有的記憶歸零。他必須做出選擇：投胎轉世卻可能變成蝸牛；或是擔任神職，累積陰德再修轉世為人的正果？阿綸決定成為月老新鮮人，他與個', '台灣/月老.jpg', 'https://www.youtube.com/watch?v=mYRH8e5ui-k', 17),
(6, '台灣男子葉石濤', '1', '葉石濤是台文界扛鼎的前輩作家，他出生於日治晚期，十幾歲便以日文寫作，在文壇嶄露頭角。於戰後，大多數台籍作家因難以跨越日文轉華文的書寫，而結束寫作生命，葉石濤是少數轉換語言成功', '台灣/台灣男子葉石濤.jpg', 'https://www.youtube.com/watch?v=mYRH8e6ui-k', 10),
(7, '我的少女時代', '1', '林真心，一個平凡至極的高中女生，偏偏喜歡上全校最受歡迎的男神歐陽非凡。\n偶然發現他和校花陶敏敏交往的秘密；在喜歡敏敏的流氓學生徐太宇的脅迫下，兩人組成「失戀陣線聯盟」，誓言拆', '台灣/我的少女時代.jpg', 'https://www.youtube.com/watch?v=mYRH8e7ui-k', 13),
(8, '角頭2', '1', '《角頭2-王者再起》延續《角頭》「今天公祭，明天忘記」、「歹路不可行」的警世主旨，導演顏正國以過來人的身分表示，拍攝黑幫電影，是想以自身成長經驗中所付出的代價警惕年輕學子不宜輕', '台灣/角頭2.jpg', 'https://www.youtube.com/watch?v=mYRH8e8ui-k', 3),
(9, '怪胎', '1', '在愛情的世界裡，我們是彼此的怪胎。\n陳柏青是一名嚴重神經性強迫症患者，有非常嚴重的潔癖，非不得已要出門時都是全副武裝；穿防塵衣、戴手套、戴口罩，還會不停的洗手，所以他幾乎沒辦', '台灣/怪胎.jpg', 'https://www.youtube.com/watch?v=mYRH8e9ui-k', 2),
(10, '返校', '1', '1962年，寂寥而肅殺的時代，翠華中學高三生方芮欣，意外與輔導老師張明暉相戀，在問題叢生的家庭及學校中，他成為她唯一的出路。追求自由的張明暉，另與師生殷翠涵、魏仲廷等人組織讀書會', '台灣/返校.jpg', 'https://www.youtube.com/watch?v=mYRH8e10ui-k', 12),
(11, '看見台灣', '1', '《看見台灣》耗資總計9000萬新台幣的金額完成，可說是台灣紀錄片影史以來，拍攝成本最高的電影。導演齊柏林花了將近3年的時間拍攝，在全台灣的上空飛行，總計累積了400小時的直升機飛行時', '台灣/看見台灣.jpg', 'https://www.youtube.com/watch?v=mYRH8e11ui-k', 2),
(12, '娜娜：逝水年華', '1', '描述1960年代改朝換代的印尼，一位走不出戰亂夢靨的上流婦人娜娜，如今看似與丈夫過著幸福的生活，某天卻暗地發現丈夫外遇。選擇沉默的娜娜，壓抑心中的秘密，在無人傾吐的情況下，甚至試', '台灣/娜娜：逝水年華.jpg', 'https://www.youtube.com/watch?v=mYRH8e12ui-k', 1),
(13, '海角七號', '1', '2008年8月22日早場起！\n\n生命，只有一回！\n夢想，不會只有一次！\n錯過的愛情，只要肯回頭，還是有找回心靈相印的一天……。\n\n這是一個關於音樂、夢想、與愛情的故事。\n\n六十多年前，台灣', '台灣/海角七號.jpg', 'https://www.youtube.com/watch?v=mYRH8e13ui-k', 1),
(14, '消失的情人節', '1', '公車司機阿泰（劉冠廷/飾），是一個動作慢吞吞、連手錶的時間、地震的感應都比別人慢的奇葩。他每天都會去郵局，找櫃員楊曉淇（李霈瑜/飾）寄一封不知道給誰的平信。櫃員楊曉淇和阿泰完全', '台灣/消失的情人節.jpg', 'https://www.youtube.com/watch?v=mYRH8e14ui-k', 2),
(15, '素還真', '1', '★絕對正宗！布袋戲雙巨頭「十車書」黃強華x「八音才子」黃文擇聯手鉅獻！\n★ 台灣傳奇英雄「素還真」從未曝光的英雄起源，再掀玄幻武林新旋風！\n\n唯有我，才能成就我的宿命！\n少年素還真', '台灣/素還真.jpg', 'https://www.youtube.com/watch?v=mYRH8e15ui-k', 1),
(16, '推手', '1', '來自中國北京的太極拳總教頭朱老先生，退休後被兒子接到美國與兒媳孫子同住。初來乍到的朱老難以適應美國生活，因文化差異、語言不通，與兒媳屢次產生摩擦。朱老擔心兒子為難，離家出走到', '台灣/推手.jpg', 'https://www.youtube.com/watch?v=mYRH8e16ui-k', 5),
(17, '飲食男女', '1', '唐士哲〈曾江飾〉是杭州城內遠近馳名的蔬食大廚，經營一家高檔的「好風水」蔬食菜館平日賓客絡繹不絕，生意興隆，招牌菜蓮花盅、煙燻黃金耳、銀芽豆皮捲不僅食材講究，擺盤更是精雕細琢，', '台灣/飲食男女.jpg', 'https://www.youtube.com/watch?v=mYRH8e17ui-k', 2),
(18, '搖擺男孩', '1', '來自北韓的叛逆青年奇秀（都敬秀 飾），在戰俘營裡被踢躂舞的魅力深深吸引，於是加入了一個名為「Swing Kids」的舞團。然而，只想在戰俘營中盡情跳舞的小小夢想，卻讓這群不分南北陣營與', '台灣/搖擺男孩.jpg', 'https://www.youtube.com/watch?v=mYRH8e18ui-k', 2),
(19, 'BJ單身日記', '2', '三十來歲的大齡剩女布莉琪瓊斯(芮妮齊薇格 飾)，昏沉地迎接新年的第一天，帶著宿醉，突然驚覺自己可能一輩子都嫁不出去，於是她決定振作精神，並許下兩個新年目標。第一就是減肥，第二就', '歐美/BJ單身日記.jpg', 'https://www.youtube.com/watch?v=mYRH8e19ui-k', 9),
(20, 'V怪客', '2', '【V怪客】一片的故事發生在未來的英國極權社會，描述一名年輕女子艾薇被一名被稱為“V怪客”的蒙面男子救了一命。\n\nV怪客不但博學多聞、出口成章，而且武藝高強、溫柔敏感，他打算發起一', '歐美/V怪客.jpg', 'https://www.youtube.com/watch?v=mYRH8e20ui-k', 16),
(21, '一級玩家', '2', '最新科幻動作冒險片《一級玩家》由史蒂芬史匹柏執導，改編自恩斯特克萊恩（Ernest Cline）風靡全球的同名暢銷小說《一級玩家》。\n《一級玩家》電影的背景設定在2045年，全世界正瀕臨混亂', '歐美/一級玩家.jpg', 'https://www.youtube.com/watch?v=mYRH8e21ui-k', 55),
(22, '一路上有妳', '2', '薇莉和米娜這對姊妹總是在爭吵與對立。姊姊薇莉是個熱情且感性的地方歌手，努力追逐夢想；妹妹米娜則是名冷漠又理性的藝術治療師，兩人疏於聯繫生活毫無交集。就在一次薇莉準備前往巴黎參', '歐美/一路上有妳.jpg', 'https://www.youtube.com/watch?v=mYRH8e22ui-k', 34),
(23, '小王子', '2', '還記得金髮小男孩與飛行員在沙漠中相遇的故事嗎？曾帶給無數人感動，安東尼‧聖修伯里的經典名著《小王子》化為互動式虛擬實境體驗，以繪本般的精緻畫面展現在你眼前。這次你將沈浸於故事', '歐美/小王子.jpg', 'https://www.youtube.com/watch?v=mYRH8e23ui-k', 13),
(24, '小美人魚', '2', '美麗動人的小人魚愛麗兒是個嚮往冒險和浪漫的美麗人魚，一心嚮往水底以外的繽紛世界。但是做為川頓國王最小的女兒，她卻只能被人魚王國的法律所禁止接觸人類。', '歐美/小美人魚.jpg', 'https://www.youtube.com/watch?v=mYRH8e24ui-k', 2),
(25, '不看鐵達尼號的男人', '2', '「我們有可能在過世前見彼此一面嗎？」\n亞科是個幽默健談的電影粉，激賞詹姆斯卡麥隆是最偉大的動作片導演，卻堅持《鐵達尼號》是影史大爛片，更可惡的是《鐵達尼號》居然比《魔鬼終結者', '歐美/不看鐵達尼號的男人.jpg', 'https://www.youtube.com/watch?v=mYRH8e25ui-k', 3),
(26, '午後彌撒', '2', '一場校園槍擊事件爆發後多年，被害者與槍手雙方父母，終於首度同意在教堂會面交談，希望透過對話能讓彼此試圖向前邁進，同時設法修復這場徹底撕裂他們人生的慘痛悲劇。然而，背負多年的喪', '歐美/午後彌撒.jpg', 'https://www.youtube.com/watch?v=mYRH8e26ui-k', 1),
(27, '友你才精彩', '2', '有你相伴，笑看人生缺憾\n路易（貝赫恭朋 飾）是名盡忠職守的中年禮儀師，從小生活在棺材、葬禮及死亡中，一年接觸近千具大體的他，每天過著機械式般的孤獨生活。一場交通意外，他將騎著自', '歐美/友你才精彩.jpg', 'https://www.youtube.com/watch?v=mYRH8e27ui-k', 2),
(28, '天能', '2', '一名CIA探員受神祕組織之雇，潛入幽冥晦暗的國際諜報世界，執行一項超越現實時間限制的重大任務。在搭檔尼爾的協助下，他必須熟悉運用「時間逆轉」的物理現象，找到試圖引起第三次世界大', '歐美/天能.jpg', 'https://www.youtube.com/watch?v=mYRH8e28ui-k', 2),
(29, '巴斯光年(英文版)', '2', '伴隨「飛向宇宙，浩瀚無垠」經典登場詞出場，身為皮克斯《玩具總動員》系列中備受喜愛的玩具，《巴斯光年》推出首部個人電影，找來「美國隊長」克里斯伊凡擔任配音，絕佳組合備受粉絲期待', '歐美/巴斯光年(英文版).jpg', 'https://www.youtube.com/watch?v=mYRH8e29ui-k', 1),
(30, '心靈捕手', '2', '年輕人威爾杭汀（Will Hunting），一個在麻省理工學院擔任清潔工，卻在高等數學方面有著過人天賦的叛逆天才。在教授西恩麥奎爾和朋友查克的幫助下，威爾最終把心靈打開，消除了人際隔閡，', '歐美/心靈捕手.jpg', 'https://www.youtube.com/watch?v=mYRH8e30ui-k', 1),
(31, '失速母親', '2', '住在巴黎近郊的單親媽媽茱莉，靠著一份高級飯店的房務清潔工作獨立撫養兩個孩子，她總是在家庭和工作之間疲於奔命，天天通勤往返巴黎市區，早出晚歸難以喘息，卻仍盼望會有更好的工作機會', '歐美/失速母親.jpg', 'https://www.youtube.com/watch?v=mYRH8e31ui-k', 1),
(32, '回到未來三', '2', '他們把最大的旅程留到最後，最受歡迎的時間旅行電影三部曲在Back to the Future Part III劃下精彩尾聲！一場怪意外之後被困在1995年的麥提麥佛萊 (米高福克斯)發現他必須回到1885年拯救達', '歐美/回到未來三.jpg', 'https://www.youtube.com/watch?v=mYRH8e32ui-k', 0),
(33, '地心引力', '2', '《地心引力》由珊卓布拉克（《攻其不備》、《愛情限時簽》）和喬治克隆尼（《型男飛行日誌》、《諜對諜》）兩大奧斯卡獎得主領銜主演，奧斯卡獎提名導演艾方索柯朗（《哈利波特：阿茲卡班', '歐美/地心引力.jpg', 'https://www.youtube.com/watch?v=mYRH8e33ui-k', 1),
(34, '好好說再見', '2', '親愛的兒子，我願陪你走到生命盡頭…\n\n戲劇表演教師班傑明意外發現自己罹患癌症，他無法面對現實、拒絕接受治療。而他年邁的母親得知兒子病情後，強忍著悲傷，試圖說服他接受痛苦的療程，', '歐美/好好說再見.jpg', 'https://www.youtube.com/watch?v=mYRH8e34ui-k', 0),
(35, '劫命救護', '2', '在洛杉磯街頭的一天之內，三個人的生命即將永遠改變。\n\n在這部億萬導演兼製片麥可貝執導，劇情緊湊、驚險刺激的驚悚片中，功勳彪炳的退伍軍人威爾夏普（《糖果人》、《駭客任務：復活》艾', '歐美/劫命救護.jpg', 'https://www.youtube.com/watch?v=mYRH8e35ui-k', 0),
(36, '忌妒的藍圖', '2', '一名人生歷經洗鍊、僅有少許浪漫邂逅經驗的荷蘭船長賈可柏，在咖啡廳與朋友打賭，將要娶第一位走進咖啡廳的女人，然後美麗的莉茲就在此時走了進來…。兩人從一開始的一見鍾情，逐漸引發了', '歐美/忌妒的藍圖.jpg', 'https://www.youtube.com/watch?v=mYRH8e36ui-k', 0),
(37, '沙丘', '2', '《沙丘》講述一個神祕又性格強烈的英雄之心路歷程，本片講述保羅亞崔迪的故事，他是一個聰明又富有天賦的年輕人，肩負超越自己理解的偉大天命，且必須遠行至宇宙中最危險的行星，以確保他', '歐美/沙丘.jpg', 'https://www.youtube.com/watch?v=mYRH8e37ui-k', 1),
(38, '侏羅紀世界：統霸天下', '2', '今年夏天，準備體驗兩個世代的演員，首度同台演出《侏羅紀公園》電影系列史詩般的最終篇章。元老級演員蘿拉鄧恩、傑夫高布倫以及山姆尼爾，加入克里斯普瑞特與布萊絲達拉斯霍華，共同主演', '歐美/侏羅紀世界：統霸天下.jpg', 'https://www.youtube.com/watch?v=mYRH8e38ui-k', 0),
(39, '奇異博士2：失控多重宇宙', '2', '漫威影業2022年重磅鉅作，重新定義大銀幕視覺饗宴。\n\n漫威宇宙進入第四階段，格局更宏大的多重宇宙，一個充滿危險，多重現實、奇異交錯的未知世界。奇異博士與信念相合的夥伴、神秘的盟友', '歐美/奇異博士2：失控多重宇宙.jpg', 'https://www.youtube.com/watch?v=mYRH8e39ui-k', 1),
(40, '怪獸與鄧不利多的秘密', '2', '華納兄弟影業即將推出的《怪獸與鄧不利多的秘密》是J.K.羅琳所創造的魔法世界中的最新冒險故事。\n\n阿不思鄧不利多教授（裘德洛 飾演）知道強大的黑巫師蓋勒葛林戴華德（邁茲米克森 飾演）', '歐美/怪獸與鄧不利多的秘密.jpg', 'https://www.youtube.com/watch?v=mYRH8e40ui-k', 1),
(41, '放牛班的春天', '2', '一個泛黃的日記本，讓聞名全球的指揮家，喚醒兒時的點點滴滴…\n\n『那年夏天，馬修老師踏進鳥不生蛋的輔育院，任務是“輔導”我們這群無可救藥的孩子。聽說這過氣的音樂老師竟然想當作曲家', '歐美/放牛班的春天.jpg', 'https://www.youtube.com/watch?v=mYRH8e41ui-k', 0),
(42, '明天過後', '2', '氣候學家傑克霍爾（丹尼斯奎德飾演）觀察史前氣候研究指出，溫室效應帶來的全球暖化將會引發地球空前災難。傑克博士曾警告政府官員採取預防行動，但警告顯然已經太晚。霍爾博士急告副總統', '歐美/明天過後.jpg', 'https://www.youtube.com/watch?v=mYRH8e42ui-k', 1),
(43, '花木蘭', '2', '知名電影人妮琪卡羅將花木蘭的史詩傳奇化為現實，變成一場激勵人心的精彩冒險，一位無畏的年輕女子出於對家庭與國家的愛而冒著生命的危險，成為中國史上最偉大的戰士之一。當皇帝頒佈法令', '歐美/花木蘭.jpg', 'https://www.youtube.com/watch?v=mYRH8e43ui-k', 1),
(44, '阿凡達', '2', '金獎票房大導詹姆斯卡麥隆的影史票房冠軍科幻史詩經典《阿凡達》即將重返大銀幕，透過4K HDR頂尖技術，全面升級3D視效以及震撼音效的影音效果，令影迷以前所未有的全新體驗，回歸2154年潘', '歐美/阿凡達.jpg', 'https://www.youtube.com/watch?v=mYRH8e44ui-k', 0),
(45, '阿甘正傳', '2', '二次大戰剛結束，阿甘出生在美國阿拉巴馬州的一個閉塞小鎮，他先天弱智，但上帝又賜予他一雙疾步如飛的飛毛腿和一副單純正直．不存半點邪念的頭腦。小鎮上的人都對阿甘另眼相待，只有兩位', '歐美/阿甘正傳.jpg', 'https://www.youtube.com/watch?v=mYRH8e45ui-k', 0),
(46, '阿達一族2', '2', '大家最喜歡的恐怖家庭，在全新動畫喜劇續集電影《阿達一族2》再度回歸。在這部全新動畫片中，我們可以發現高魔子和魔帝女對於小孩子漸漸長大而感到心煩意亂，不參加家庭聚餐，並完全沉浸', '歐美/阿達一族2.jpg', 'https://www.youtube.com/watch?v=mYRH8e46ui-k', 0),
(47, '拜金女王的性愛派對', '2', '有錢人跟你玩的不一樣! 豪華遊艇、昂貴五星酒店、杜拜、坎城和聖特羅佩海灘；五顏六色的飲料、毒品和性；這就波蘭伴遊女郎的生活。她們的成員不乏包括模特兒、明星、選美小姐和藝術家。在', '歐美/拜金女王的性愛派對.jpg', 'https://www.youtube.com/watch?v=mYRH8e47ui-k', 0),
(48, '美國女孩', '2', '2003年，移民美國五年的莉莉（林嘉欣 飾）抱病帶著兩個女兒芳儀（方郁婷 飾）、芳安（林品彤 飾）從洛杉磯回到台灣，與聚少離多的丈夫宗輝（莊凱勛 飾）團聚。芳儀因中文障礙成績落後，被', '歐美/美國女孩.jpg', 'https://www.youtube.com/watch?v=mYRH8e48ui-k', 0),
(49, '美國舞孃', '2', '年輕女孩諾咪（伊莉莎白柏克莉 飾）前往拉斯維加斯追求舞蹈夢， 卻意外踏入賭場上空秀的浮華世界，在一步登天之際，又陷入與當家花旦克莉絲朵（吉娜葛森 飾）和創意總監之間性慾橫流的三', '歐美/美國舞孃.jpg', 'https://www.youtube.com/watch?v=mYRH8e49ui-k', 0),
(50, '美麗人生', '2', '臺灣電視公司60周年台慶八點檔連續劇，以1960年代的旗津半島上，三位臺灣女人的家族故事。含有大高雄地區的建設與高雄港開發歷史過程，包括土地被徵收、挖空，漁業與養殖業汙染、迫遷等困', '歐美/美麗人生.jpg', 'https://www.youtube.com/watch?v=mYRH8e50ui-k', 0),
(51, '音速小子 2', '2', '全世界最受歡迎的藍色刺蝟又回來了，他在《音速小子2》一片中將有一場升級的精采冒險。音速小子索尼克在綠丘鎮安頓下來之後，他就急著要證明自己有能力成為一名真正的英雄。當蛋頭博士帶', '歐美/音速小子 2.jpg', 'https://www.youtube.com/watch?v=mYRH8e51ui-k', 0),
(52, '捍衛戰士：獨行俠', '2', '派拉蒙影業1986年推出的《捍衛戰士》，由湯姆克魯斯主演，是一齣以航空母艦與美國海軍戰鬥機武器學校為背景的勵志動作電影，在當年締造了全球3億5千6百多萬美元的票房成績。睽違33年之後', '歐美/捍衛戰士：獨行俠.jpg', 'https://www.youtube.com/watch?v=mYRH8e52ui-k', 0),
(53, '格瑞特真相', '2', '彭昕(莫允雯 飾)為法務部調查局的調查官，為調查局組長李博遙(李至正 飾)下屬。某天一家科技公司的機密專利遭人竊取，一切犯罪證據皆指向彭昕的工程師前男友劉皓然(夏騰宏 飾)，不顧組長', '歐美/格瑞特真相.jpg', 'https://www.youtube.com/watch?v=mYRH8e53ui-k', 0),
(54, '海上的鋼琴師', '2', '每個聽過「1900」演奏的人，都會被深深打動…\n豪華郵輪「維吉尼亞號」上，燃煤工人丹尼有天在鋼琴上，發現一名被遺棄的嬰兒。當天正好是1900年元旦，目不識丁的他，於是將嬰兒取名「1900', '歐美/海上的鋼琴師.jpg', 'https://www.youtube.com/watch?v=mYRH8e54ui-k', 0),
(55, '真善美', '2', '一九三八年籠罩在納粹陰影下的奧地利修道院，修女瑪麗亞因為遲歸違反院規，被修道院派到海軍上校特拉普家中，當七個小孩的家庭教師，這項「處罰」改變了瑪麗亞和這個家庭的命運。瑪麗亞擔', '歐美/真善美.jpg', 'https://www.youtube.com/watch?v=mYRH8e55ui-k', 0),
(56, '航站情緣', '2', '為了能使這個家庭有個母親，特拉普準備和鄰近的男爵夫人籌辦婚事，可是這位男爵夫人每次來作客，都儼然以女主人自居，因此孩子們都反對父親的這樁婚事。特拉普清楚知道孩子們離不開瑪麗亞', '歐美/航站情緣.jpg', 'https://www.youtube.com/watch?v=mYRH8e56ui-k', 0),
(57, '記憶殺神', '2', '在納粹準備逮捕特拉普時，瑪麗亞靈機一動向當局提出：全家參加當地舉辦的歌唱比賽後，再讓特拉普應征。在演唱會上，特拉普一家人以充滿感情的歌聲向祖國親人告別，獲得了軍隊的獎勵。授獎', '歐美/記憶殺神.jpg', 'https://www.youtube.com/watch?v=mYRH8e57ui-k', 0),
(58, '逃出封鎖線', '2', '就在特拉普全家即將逃出虎口時，突然郵差魯夫身穿著納粹軍裝，持槍攔在路口，特拉普走上去，揮拳將他擊倒，一家人迅速轉移。納粹發現他們的行蹤後，開車準備追趕，誰知汽車事先被修道院的', '歐美/逃出封鎖線.jpg', 'https://www.youtube.com/watch?v=mYRH8e58ui-k', 0),
(59, '偉大的印度廚房', '2', '原本光鮮亮麗的舞者，嫁做人婦之後，廚房成了她僅有的天地。早上第一個起床張羅一家子的早餐，丈夫和公公用餐時與婆婆一起服侍在側，等收拾完男人們留下的一片狼藉後，再回到廚房獨自吃著', '歐美/偉大的印度廚房.jpg', 'https://www.youtube.com/watch?v=mYRH8e59ui-k', 0),
(60, '深海擴散', '2', '孤僻的女海洋生物學家西沃恩，跟隨著一艘破舊的拖網漁船出海，進行為期一週的研究，原以為單純的任務，卻因與整組船員格格不入而備感壓力。但船行至大西洋深海區，卻意外陷入不明海底生物', '歐美/深海擴散.jpg', 'https://www.youtube.com/watch?v=mYRH8e60ui-k', 0),
(61, '尋人啟弒', '2', '「爸爸今天看見那個被通緝的連環殺手了喔，抓到他就可以有三百萬懸賞金。」父親前晚才跟女兒這樣說著，隔天就人間蒸發。焦急的女兒四處追尋，循線來到父親打零工的地方，用父親的名字一喊', '歐美/尋人啟弒.jpg', 'https://www.youtube.com/watch?v=mYRH8e61ui-k', 0),
(62, '悲慘世界', '2', '他們的執法過當，竟全遭空拍機拍了下來…\n史蒂芬（達米安勃納爾Damien Bonnard飾）剛加入巴黎蒙費梅伊（Montfermeil）地區的犯罪防治小隊，此地正是大文豪雨果當年寫出巨作【悲慘世界】的', '歐美/悲慘世界.jpg', 'https://www.youtube.com/watch?v=mYRH8e62ui-k', 0),
(63, '最後的生存者', '2', '大浩劫後，特洛伊在距離殘破的城市千里之外，被森林環繞的家園中獨自一人撫養兒子傑克長大。某天特洛伊受了重傷，傑克不得不到外面的世界尋找救命藥品。特洛伊告訴傑克，不管遇到誰都先殺', '歐美/最後的生存者.jpg', 'https://www.youtube.com/watch?v=mYRH8e63ui-k', 0),
(64, '越界分身', '2', '從事國際翻譯員的茱蒂時常奔波各地，當她回到法國，與指揮家的夫婿穿梭於上流社會的社交場合，這是她法國的生活日常。\n\n然而茱蒂悄悄跨越了國界到了瑞士，對外用著不同的名字，回到與愛人', '歐美/越界分身.jpg', 'https://www.youtube.com/watch?v=mYRH8e64ui-k', 0),
(65, '媽的多重宇宙', '2', '55歲的美國華裔移民秀蓮（楊紫瓊飾）家庭事業兩崩潰。在老爸爸（吳漢章飾）生日大壽這天，除了要阻止女兒（史蒂芬妮許）暴走出櫃、替無用丈夫（關繼威）擦屁股，還得去稅務局向古板大嬸（', '歐美/媽的多重宇宙.jpg', 'https://www.youtube.com/watch?v=mYRH8e65ui-k', 0),
(66, '楚門的世界', '2', '楚門伯班從他呱呱落地開始的三十幾年以來，就是史上播映最久、最受歡迎的記錄片肥皂劇主角，他居住的理想小鎮－海景鎮是個超大的攝影棚，而他的親朋好友和他每天碰到的人全都是職業演員。', '歐美/楚門的世界.jpg', 'https://www.youtube.com/watch?v=mYRH8e66ui-k', 0),
(67, '獅子王', '2', '獅子王木法沙，是草原上榮耀國的國王，萬物在他睿智的帶領下，日出日落，生生不息。當他與妻子莎拉碧誕下小王子辛巴後，全國上下一片歡欣鼓舞，只有木法沙的弟弟刀疤心生不滿，辛巴的出生', '歐美/獅子王.jpg', 'https://www.youtube.com/watch?v=mYRH8e67ui-k', 0),
(68, '當幸福來敲門', '2', '本片根據真實故事改編，可以說是【永不妥協】的男生版。故事描述一個單親爸爸，因為事業失敗窮途潦倒到無家可歸，卻還得擔起撫養兒子的重擔。為了兒子的未來，他重新振作，處處向機會敲門', '歐美/當幸福來敲門.jpg', 'https://www.youtube.com/watch?v=mYRH8e68ui-k', 0),
(69, '詭棋', '2', '一個人煙稀少的毆洲小鎮，平日連竊盜案都沒有，竟然出現恐怖的連續殺人案件，小鎮居民在一個月內陸續死亡，女警塔瑪拉（伊莉絲蕾薇斯克 飾）從前的刑警搭檔也是死者之一，讓小鎮的耳語不', '歐美/詭棋.jpg', 'https://www.youtube.com/watch?v=mYRH8e69ui-k', 0),
(70, '雷神索爾：愛與雷霆', '2', '終局過後，身經百戰的雷神索爾（克里斯漢斯沃 飾）展開全新旅程，而這趟旅程讓他發現前所未有的追尋目的－內心平靜，豈料退休生活不如己願，全新邪惡勢力「屠神者格爾」（克里斯汀貝爾 飾', '歐美/雷神索爾：愛與雷霆.jpg', 'https://www.youtube.com/watch?v=mYRH8e70ui-k', 0),
(71, '蝙蝠俠', '2', '布魯斯韋恩雖然是高譚市首富家族的繼承者，性格卻非常孤僻，同時在夜晚化身為蝙蝠俠打擊罪犯。布魯斯韋恩剛化身為蝙蝠俠第二年，年輕憂鬱、全身散發虛無飄渺的氣息，常常潛伏在高譚市的街', '歐美/蝙蝠俠.jpg', 'https://www.youtube.com/watch?v=mYRH8e71ui-k', 0),
(72, '蝙蝠俠-黑暗騎士', '2', '從親眼目睹父母被人殺死的陰影中走出來的蝙蝠俠，經歷了成長之後，已經不再是那個桀驁不的孤單英雄了。在警官吉姆·戈登和檢查官哈維·登特的通力幫助下，蝙蝠俠無後顧之憂地繼續滿世界的', '歐美/蝙蝠俠-黑暗騎士.jpg', 'https://www.youtube.com/watch?v=mYRH8e72ui-k', 0),
(73, '蝙蝠俠-黑暗騎士崛起', '2', '民眾需要英雄，當大家得知這個人其實並非站在正義的一方，會不會理想崩塌？檢察官哈維·登特死後的八年間，哥譚市在戈登警長的努力下有效地遏制了犯罪活動。而蝙蝠俠布魯斯·韋恩（克里斯', '歐美/蝙蝠俠-黑暗騎士崛起.jpg', 'https://www.youtube.com/watch?v=mYRH8e73ui-k', 0),
(74, '衝鋒戰士劇場版：翁法洛斯島的秘密', '2', '出發前往溫暖南太平洋度假的車皓一家漂流到了某個孤島，那裡被稱爲地球的「肚臍」，是有著強大生命力的一座神祕島嶼＂翁法洛斯島＂。在那裡，車皓一家人受到了想要奪取＂超級能量媒炭＂的', '歐美/衝鋒戰士劇場版：翁法洛斯島的秘密.jpg', 'https://www.youtube.com/watch?v=mYRH8e74ui-k', 0),
(75, '戰地夜曲', '2', '揮去烽火　看見黑暗中的一束光\n中東戰火不斷，強權覬覦未歇。暴政、侵略和恐怖主義，在惡性循環中遮蔽了天空，讓人民不見天日。心碎母親撫觸牢房牆垣，哀聲憑弔枉死的孩子；庫德敢死軍女', '歐美/戰地夜曲.jpg', 'https://www.youtube.com/watch?v=mYRH8e75ui-k', 0),
(76, '親愛的母親', '2', '我最深愛的人傷我卻是最深！\n關於相處，為何總是越愛越錯？\n\n住在鄉間的安娜失去了老伴後孤家寡人，在市區擔任醫師的女兒伊莎在父親的喪禮後，把母親安娜接到城裡一起同住。母女倆表面上', '歐美/親愛的母親.jpg', 'https://www.youtube.com/watch?v=mYRH8e76ui-k', 0),
(77, '貓王艾維斯', '2', '片中將探索貓王艾維斯普里斯萊（奧斯汀巴特勒 飾演）的生平和音樂，一窺他與神祕經紀人科洛內爾湯姆帕克（湯姆漢克斯 飾演）的複雜關係。故事將會深入貓王與帕克之間超過20年的合作互動，', '歐美/貓王艾維斯.jpg', 'https://www.youtube.com/watch?v=mYRH8e77ui-k', 0),
(78, '駭客任務一', '2', '《駭客任務》故事敘述電腦駭客尼歐(基努李維 飾)，他不斷地尋找母體的真相，雖然神秘又無法捉摸，但他相信母體正以無法想像的邪惡方式控制著他的人生，讓他難以獲得真正的自由，他寄望於', '歐美/駭客任務一.jpg', 'https://www.youtube.com/watch?v=mYRH8e78ui-k', 0),
(79, '駭客任務二', '2', '駭客任務：重裝上陣】的故事延續上一集的劇情，母體發現人類最後的堡壘城市錫安原來藏在接近地球核心的深處，而人類只剩七十二小時能阻止幾千艘狀似烏賊的巡邏艦大舉進攻。\n\n他們的唯一希', '歐美/駭客任務二.jpg', 'https://www.youtube.com/watch?v=mYRH8e79ui-k', 0),
(80, '駭客任務三', '2', '《駭客任務：復活》由原系列導演拉娜華卓斯基執導，是影迷期待已久的《駭客任務》系列第四集，該系列開創性的詮釋重新定義了電影類型。這部新片集結了原班人馬基努李維與凱莉安摩絲，重新', '歐美/駭客任務三.jpg', 'https://www.youtube.com/watch?v=mYRH8e80ui-k', 0),
(81, '闇黑電話', '2', '「電話壞了，但它仍然在響。」\n導演史考特德瑞森回歸根源，執導他擅長的恐怖類型電影，並且再度和製作恐怖類型片首屈一指的布倫屋製作公司合作，推出一部全新恐怖驚悚片。\n\n一個害羞但聰', '歐美/闇黑電話.jpg', 'https://www.youtube.com/watch?v=mYRH8e81ui-k', 0),
(82, '獵殺戰場', '2', '為了拿下一項軍事標案，一家AI機器人製造商買通一名中央情報局探員，進行了一場未授權的非法武裝軍事行動。他們將四個AI機器人原型放進亞洲金三角地區進行測試，這場非法軍事行動原為測試', '歐美/獵殺戰場.jpg', 'https://www.youtube.com/watch?v=mYRH8e82ui-k', 0),
(83, '鯊顫', '2', '一群年輕人到墨西哥海邊渡假，開心地在沙灘上喝酒狂歡，甚至還順手從岸邊偷了兩艘水上摩托車出海玩樂，卻因為玩過頭而意外相撞，導致一台沉入海中，另一台則故障無法發動，還因此讓一名友', '歐美/鯊顫.jpg', 'https://www.youtube.com/watch?v=mYRH8e83ui-k', 0),
(84, '壞蛋聯盟', '2', '「從沒有人像壞蛋聯盟這樣盡力想使壞，卻徹底失敗。」\n夢工廠動畫推出的全新動作喜劇動畫片，改編自《紐約時報》暢銷童書系列，故事描述一群動物犯罪高手組成的壞蛋聯盟，企圖設計一場到', '歐美/壞蛋聯盟.jpg', 'https://www.youtube.com/watch?v=mYRH8e84ui-k', 0),
(85, '羅密歐與茱麗葉（英國國家劇院現場）', '2', '8/7 Sun 14:30＠高雄市總圖際會廳（7樓進場）\n英國大劇作家莎士比亞辭世四百週年，最具代表性現代版改編\n李奧納多上 《鐵達尼號》前與克萊兒丹妮絲絕美樓台會\n由《大亨小傳》導演巴茲魯曼', '歐美/羅密歐與茱麗葉（英國國家劇院現場）.jpg', 'https://www.youtube.com/watch?v=mYRH8e85ui-k', 0),
(86, '鐵達尼號', '2', '故事講述傑克(李奧納多狄卡皮歐 飾)，一個四處為家的年輕人，在贏得牌局的賭注(鐵達尼號船票2張)後，搭上了鐵達尼號，準備在新世界(美國)開展新生活。一日在甲板散步時，意外解救了要跳船', '歐美/鐵達尼號.jpg', 'https://www.youtube.com/watch?v=mYRH8e86ui-k', 0),
(87, '驅神', '2', '一位在墨西哥執業的美國神父，在進行人生第一次驅魔儀式時反遭惡靈附身，因此犯下無法挽回的錯誤；十八年後，這項錯誤導致的後遺症捲土重來，他必須設法彌補這一切...', '歐美/驅神.jpg', 'https://www.youtube.com/watch?v=mYRH8e87ui-k', 0),
(88, '魔比斯', '2', '在漫威宇宙中最具爭議性且複雜的角色即將在大銀幕與全球觀眾見面！由奧斯卡得主傑瑞德雷托領軍，飾演一位患有罕見疾病的生物化學博士麥可魔比斯；為治療自己的疾病，並試圖挽救其他遭受相', '歐美/魔比斯.jpg', 'https://www.youtube.com/watch?v=mYRH8e88ui-k', 0),
(89, '魔戒一', '2', '故事由《魔戒首部曲：魔戒現身》展開，一位名叫佛羅多的年輕人，無意間得到一枚有著神秘力量的戒指，卻發現這枚戒指原來是黑暗魔王索倫所擁有。幾經波折後，他決定摧毀魔戒，以免索倫奪回', '歐美/魔戒一.jpg', 'https://www.youtube.com/watch?v=mYRH8e89ui-k', 0),
(90, '魔戒二', '2', '在《魔戒二部曲：雙城奇謀》中，魔戒遠征隊四分五裂、分道揚鑣，每位成員都將遭遇想像不到的敵人與難關。佛羅多和山姆在山區迷路，遇到長期受到魔戒影響，身心嚴重扭曲的生物咕嚕；被抓走', '歐美/魔戒二.jpg', 'https://www.youtube.com/watch?v=mYRH8e90ui-k', 0),
(91, '魔戒三', '2', '遠征隊的旅程即將在《魔戒三部曲：王者再臨》畫下句點，中土世界的真正大戰即將到來，眾人集合所有力量來擊敗索倫。儘管不停遭受失落，遠征隊還是持續前往他們這一生最重要的一場戰役，合', '歐美/魔戒三.jpg', 'https://www.youtube.com/watch?v=mYRH8e91ui-k', 0),
(92, '魔鬼終結者二', '2', '在第一集中，天網派出終結者欲滅殺未來人類救星約翰康納之母莎拉康納，所幸未來戰士瑞斯利用時光機器返回現代捨命相救，天網的計畫終告失敗。這次，天網再度派出最先進的T-1000型液態金屬', '歐美/魔鬼終結者二.jpg', 'https://www.youtube.com/watch?v=mYRH8e92ui-k', 0),
(93, '蘿莉塔', '2', '大學教授賀伯特（傑瑞米艾朗 飾）在學校教法文，年少時初戀女友意外過世的回憶，導致他對10幾歲的少女無法抗拒。一次偶然的機緣下，他成為夏洛特（梅蘭妮葛莉芬 飾）的房客，並瘋狂愛上她', '歐美/蘿莉塔.jpg', 'https://www.youtube.com/watch?v=mYRH8e93ui-k', 0),
(94, '變臉', '2', '兼具西方現代視覺的張力和東方情感的憤怒\n韓國首部未發行，就轟動海外賣埠市場的恐怖電影\n\n《鬼變臉》是韓國第一部在國內還未發行，就被引進海外市場的恐怖電影。今年二月在美國最大的電', '歐美/變臉.jpg', 'https://www.youtube.com/watch?v=mYRH8e94ui-k', 0),
(95, '小偷家族', '3', '我們偷的，是羈絆\n在東京下町林立的高樓大廈之間，不合時宜地殘存一個破舊平房，裡面住著年邁的母親初枝（樹木希林飾演）、治（Lily Franky飾演）與信代（安藤櫻飾演）夫婦，以及他們的兒', '日韓/小偷家族.jpg', 'https://www.youtube.com/watch?v=mYRH8e95ui-k', 34),
(96, '太陽與波麗露', '3', '在某地方城鎮的業餘交響樂團「彌生交響樂團」，負責主導的中心人物花村理子（檀麗 飾）18年來都和熱愛音樂、富有性格的團員們一起進行活動。隨著樂團的營運愈來愈辛苦，理子拼命努力也只', '日韓/太陽與波麗露.jpg', 'https://www.youtube.com/watch?v=mYRH8e96ui-k', 47),
(97, '犯罪都市2', '3', '掃蕩加里峰洞任務後過了4年，衿川刑警隊前往越南引渡逃走的嫌犯。「怪物刑警」馬錫道（馬東石 飾）和全日萬組長（崔貴化 飾）發現在當地的嫌犯十分可疑，得知其背後有個凶惡殘暴的主使者', '日韓/犯罪都市2.jpg', 'https://www.youtube.com/watch?v=mYRH8e97ui-k', 18),
(98, '名偵探柯南 萬聖節的新娘', '3', '\"東京澀谷街頭充滿萬聖節狂歡的節慶氣氛。\n在“澀谷HIKARIE”正舉行著婚禮，披上嫁紗現身的新娘正是警視廳的佐藤警官。當柯南以及其他賓客們正興高采烈獻上祝賀時，一名男子突然闖入婚宴', '日韓/名偵探柯南 萬聖節的新娘.jpg', 'https://www.youtube.com/watch?v=mYRH8e98ui-k', 16),
(99, '你的名字', '3', '10月14至16日口碑場搶先登場，10月21日全台正式上映！\n\n只要不停止相愛 我們就能跳越時空找到彼此\n\n最青澀浪漫的戀愛奇遇！高校男孩立花瀧（神木隆之介 飾）在半夢半醒間睜開睡眼，竟發現', '日韓/你的名字.jpg', 'https://www.youtube.com/watch?v=mYRH8e99ui-k', 9),
(100, '劫獄救援', '3', '職業罪犯紅髮艾達沃克在奧克拉荷馬州服刑25年期間，正在與絕症搏鬥，時日不多。艾達不甘心就這樣死在牢中，在艾達的指導下，她的兒子懷特沃克繼承了犯罪家業，懷特的叔叔達拉斯沃克則從旁', '日韓/劫獄救援.jpg', 'https://www.youtube.com/watch?v=mYRH8e100ui-k', 3),
(101, '怪獸死了怎麼辦', '3', '讓人類陷入極大恐懼之中的巨大怪獸，有一天突然死了。在人民舉國歡慶的同時，遺留下來的屍體開始腐敗、膨脹，就這麼放任不管，會引發爆炸等重大災害。被委任處理屍體的既不是軍人也不是警', '日韓/怪獸死了怎麼辦.jpg', 'https://www.youtube.com/watch?v=mYRH8e101ui-k', 7),
(102, '神隱少年狼', '3', '年輕漫畫家在創作已絕種日本狼時，一直畫不出心中理想狼樣貌，某天在他兼職的工地，遇到正在尋找失蹤愛犬的神祕女子，他將跌倒受傷女子送回她家人經營的照相館，透過與其家人相遇，展開一', '日韓/神隱少年狼.jpg', 'https://www.youtube.com/watch?v=mYRH8e102ui-k', 18),
(103, '假面酒店', '3', '故事的舞台在五星級飯店。\n這裡有連續殺人犯出沒──\n調查對象，所有住客。\n菁英刑警和專業飯店人員。\n立場和個性都相反的兩個人，\n有辦法識破帶著假面的連續殺人犯嗎───？\n\n東京都內', '日韓/假面酒店.jpg', 'https://www.youtube.com/watch?v=mYRH8e103ui-k', 2),
(104, '寄生上流', '3', '一家四口全是無業遊民的爸爸基澤（宋康昊 飾）成天遊手好閒，直到積極向上的長子基宇（崔宇植 飾）靠著偽造的文憑來到富豪朴社長（李善均 飾）的家應徵家教，兩個天差地遠的家庭因而被捲', '日韓/寄生上流.jpg', 'https://www.youtube.com/watch?v=mYRH8e104ui-k', 23),
(105, '超跑斯特拉', '3', '朴英裴（孫浩俊飾）是汽車貸款業界的王牌，某天受黑幫老大（許城泰）所託，要賣掉價值連城的藍寶堅尼小牛超跑，然而沒想到他的童年好友東植（李奎炯飾）竟開著這輛超跑消失了，黑幫集團找', '日韓/超跑斯特拉.jpg', 'https://www.youtube.com/watch?v=mYRH8e105ui-k', 2),
(106, '解憂雜貨店', '3', '故事講述30年前有一家專門替人消憂解惑的「浪矢雜貨店」，只要在晚上把寫了煩惱的信投入鐵捲門中，隔天就可以在店後的牛奶箱得到回信。投信者包括一心想成為音樂人，不惜離家又休學的魚店', '日韓/解憂雜貨店.jpg', 'https://www.youtube.com/watch?v=mYRH8e106ui-k', 0),
(107, '電影版 99.9 不可能的翻案', '3', '總是追求事件真相，並將多起看似99.9％不可能逆轉的事件以無罪翻案的律師深山大翔（松本潤 飾），任職於斑目法律事務所刑事案件專門室，與成為新所長的佐田（香川照之 飾）、新人律師穗乃', '日韓/電影版 99.9 不可能的翻案.jpg', 'https://www.youtube.com/watch?v=mYRH8e107ui-k', 3),
(108, '劇場版 咒術迴戰 0', '3', '故事敘述一對青梅竹馬的戀人：乙骨憂太與祈本里香原本約定好長大以後要結婚，並且要永遠再一起…。但里香卻在一場車禍中橫死，死後化為強大怨靈依附在乙骨身邊，為此所苦的乙骨，甚至一心', '日韓/劇場版 咒術迴戰 0.jpg', 'https://www.youtube.com/watch?v=mYRH8e108ui-k', 2),
(109, '影武者', '3', '日本戰國時代三雄之首的武田信玄（仲代達矢飾），號稱“甲斐之虎”。他的信條是“疾如風，徐如林，侵略如火，不動如山”。當武田信玄包圍德川軍的野田城，即將直取京都完成霸業時，他被敵', '日韓/影武者.jpg', 'https://www.youtube.com/watch?v=mYRH8e109ui-k', 0),
(110, '餘命10年', '3', '20歲的茉莉（小松菜奈 飾）罹患數萬人中僅有一人會得的不治之症，被宣告餘命僅剩10年，對於生存這件事不再執著，並下定決心不再談戀愛，卻在此時，她與和人（坂口健太郎 飾）在同學會再次', '日韓/餘命10年.jpg', 'https://www.youtube.com/watch?v=mYRH8e110ui-k', 1),
(111, '螢火蟲之墓', '3', '昭和20年的那個夏天，這對兄妹留下一段讓人感傷落淚的故事...\n\n經典動畫【螢火蟲之墓】，真人版電影即將上映。\n\n太平洋戰爭已進入尾聲，戰火波及到日本本土，百姓開始過著躲避空襲的緊張', '日韓/螢火蟲之墓.jpg', 'https://www.youtube.com/watch?v=mYRH8e111ui-k', 33),
(112, '霍爾的移動城堡', '3', '愛國主義的全盛時期，國家的士兵們正準備遠赴戰地。把花兒裝飾在槍上，在歡呼中行走著。在荒郊野外裡，竟出現了一個專吃美女心臟的巫師霍爾，以及會移動的城堡。\n\n在荒地附近的城鎮，有一', '日韓/霍爾的移動城堡.jpg', 'https://www.youtube.com/watch?v=mYRH8e112ui-k', 61),
(113, '龍馬！新生網球王子劇場版（決勝版）', '3', '主人翁龍馬在日本贏得全國大賽決勝戰後毅然移地至美國進行自我訓練；剛到洛杉磯，龍馬就巧遇被街頭份子騷擾的同學龍崎櫻乃，為了拯救櫻乃，龍馬和混混們展開激烈的網球大戰，然而，在奮戰', '日韓/龍馬！新生網球王子劇場版（決勝版）.jpg', 'https://www.youtube.com/watch?v=mYRH8e113ui-k', 0),
(114, '龍馬！新生網球王子劇場版（榮耀版）', '3', '主人翁龍馬在日本贏得全國大賽決勝戰後毅然移地至美國進行自我訓練；剛到洛杉磯，龍馬就巧遇被街頭份子騷擾的同學龍崎櫻乃，為了拯救櫻乃，龍馬和混混們展開激烈的網球大戰，然而，在奮戰', '日韓/龍馬！新生網球王子劇場版（榮耀版）.jpg', 'https://www.youtube.com/watch?v=mYRH8e114ui-k', 0),
(115, '龍貓', '3', '小月、小梅兩姊妹跟著爸爸一起搬到郊外居住，準備迎接即將出院的母親，那個被戲稱「鬼屋」的新家發生許多神奇的事，包含會突然四散逃走的灰塵精靈，以及神祕的龍貓與貓巴士。有一天，小梅', '日韓/龍貓.jpg', 'https://www.youtube.com/watch?v=mYRH8e115ui-k', 1),
(116, '嬰兒轉運站', '3', '經營著洗衣店的相鉉（宋康昊 飾）總是為債務所苦，而育幼院出身的東秀（姜棟元 飾）則在管理嬰兒保護艙的機構工作。在某個下著暴雨的夜晚，他們倆偷偷帶走了保護艙中的嬰兒。沒想到隔天，', '日韓/嬰兒轉運站.jpg', 'https://www.youtube.com/watch?v=mYRH8e116ui-k', 1),
(117, '魔女二部曲：另一個她', '3', '一名少女（申始雅 飾）獨自倖存於被毀滅的祕密研究所，對於外面的世界感到陌生的少女，偶然遇見慶熙（朴恩斌 飾）和大吉（成愉頻 飾）這對姊弟，和他們成為朋友。就在少女漸漸適應溫暖的', '日韓/魔女二部曲：另一個她.jpg', 'https://www.youtube.com/watch?v=mYRH8e117ui-k', 0),
(118, '魔女宅急便', '3', '琪琪（小芝風花）是魔女媽媽可琪莉（宮澤理惠）跟凡人歐其諾（筒井道隆）結婚之後所生下的可愛女孩，繼承媽媽血統的琪琪必須遵循「在13歲的滿月之夜踏上旅程，到沒有魔女的鄉鎮生活一年」', '日韓/魔女宅急便.jpg', 'https://www.youtube.com/watch?v=mYRH8e118ui-k', 1),
(119, '一代宗師', '4', '新版的《一代宗師》將呈現一個長度約111分鐘的故事，導演改變了故事的節奏，除了變得更明快之外，也聘請了美國頂尖3D特效團隊，集合眾多的人力物力，對影片進行了整整一年的精心改造，將', '大陸/一代宗師.jpg', 'https://www.youtube.com/watch?v=mYRH8e119ui-k', 3),
(120, '功夫', '4', '1940年代的上海，自小受盡欺辱的街頭混混阿星（周星馳）爲了能出人頭地，可謂窺見機會的縫隙就往裏鑽，今次他盯上行動日益猖獗的黑道勢力“斧頭幫”，想借之大名成就大業 阿星假冒“斧頭', '大陸/功夫.jpg', 'https://www.youtube.com/watch?v=mYRH8e120ui-k', 53),
(121, '失落謎城', '4', '一位聰慧過人卻離群索居、個性孤僻的知名作家蘿莉塔賽吉（珊卓布拉克 飾）以創作故事發生在異國險境的暢銷愛情冒險小說為生，她筆下的男主人翁是根據一名高顏值的封面男模艾倫（查寧塔圖', '大陸/失落謎城.jpg', 'https://www.youtube.com/watch?v=mYRH8e121ui-k', 16),
(122, '西遊-大聖歸來', '4', '大鬧天宮後四百年多年，齊天大聖成了一個傳說，在山妖橫行的長安城，孤兒江流兒與行腳僧法明相依為命，小小少年常常神往大鬧天宮的孫悟空。 有一天，山妖來劫掠童男童女，江流兒救了一個', '大陸/西遊-大聖歸來.jpg', 'https://www.youtube.com/watch?v=mYRH8e122ui-k', 13),
(123, '我不是藥神', '4', '普通中年男子程勇（徐崢 飾）經營著一家保健品店，失意又失婚。不速之客呂受益（王傳君 飾）的到來，讓他開闢了一條去印度買藥做「代購」的新事業，雖然困難重重，但他在這條「買藥之路」', '大陸/我不是藥神.jpg', 'https://www.youtube.com/watch?v=mYRH8e123ui-k', 15),
(124, '明日戰記', '4', '在未來世界，地球因環境污染及氣候突變，寸草不生，倖存者只能在 風沙及有毒空氣中逆境求生，活在巨型溫室「天幕之中」。某天，巨型殞石墜落，長 出異種藤蔓“潘朵拉”，它們不怕污染，更', '大陸/明日戰記.jpg', 'https://www.youtube.com/watch?v=mYRH8e124ui-k', 49),
(125, '阿飛正傳', '4', '《阿飛正傳》故事以1960年代初期為背景，旭仔（阿飛）（張國榮 飾）從未見過生母，自小由養母養大，因此長大後他對生命中遇到的每一個女人都冷酷無情。放蕩不羈的他先後與售票員蘇麗珍（', '大陸/阿飛正傳.jpg', 'https://www.youtube.com/watch?v=mYRH8e125ui-k', 4),
(126, '重慶森林', '4', '223號員警 (金城武 飾)在愚人節當天和女友阿May分手後，擦肩而過邂逅了女毒犯(林青霞 飾)，形單影隻的兩人度過了一個溫情的夜晚。快餐店店員阿菲(王菲 飾)偷偷暗戀剛被空姐女友分手的663', '大陸/重慶森林.jpg', 'https://www.youtube.com/watch?v=mYRH8e126ui-k', 3),
(127, '救命緝約', '4', '詹姆士(克里斯潘恩 飾)自特種部隊退伍後，為了養家糊口加入秘密軍事組織，簽下神秘契約後奉命至東歐執行任務。某次行動中，詹姆士發現自己成為地下組織追殺的目標，為了活命他不得不違背', '大陸/救命緝約.jpg', 'https://www.youtube.com/watch?v=mYRH8e127ui-k', 10),
(128, '詛咒', '4', '2004年4月12日，靈異事件採訪作家小林雅文，完成了以「詛咒」為題材的紀錄片後，竟神秘失蹤，他的住家被大火吞噬，妻子被燒成焦屍，而小林本人至今仍下落不明…。小林留下的紀錄片作品《', '大陸/詛咒.jpg', 'https://www.youtube.com/watch?v=mYRH8e128ui-k', 5),
(129, '葉問', '4', '【葉問】描述當年正值戰禍亂世的中國，葉問是一名單純醉心武術、追求武學自由的武癡，充滿仇恨和悲劇的大時代並不在他的視野當中，他只專注於對武術的執著與熱情。然而出於對民族的熱愛和', '大陸/葉問.jpg', 'https://www.youtube.com/watch?v=mYRH8e129ui-k', 2),
(130, '達賴的一生', '4', '「這是我的西藏，只有智慧與慈悲才能解放我們。」\n\nKUNDUN，是西藏人對達賴喇嘛的尊稱，有「高貴」的意思。\n\n二戰期間，生於青海農村家庭的丹增嘉措被選為達賴喇嘛的轉世靈童，這一年他才', '大陸/達賴的一生.jpg', 'https://www.youtube.com/watch?v=mYRH8e130ui-k', 11),
(131, '達賴喇嘛：大腦故事', '4', '\n達賴喇嘛不僅是藏傳佛教的最高領袖，更是天下蒼生仰賴的精神導師。他決定退位！他是否轉世？一舉一動都牽動著世界局勢…。有人問他「面對強大中共，西藏為何膽敢堅持自由？」，也有人問', '大陸/達賴喇嘛：大腦故事.jpg', 'https://www.youtube.com/watch?v=mYRH8e131ui-k', 0),
(132, '賭神', '4', '賭神高進在頭部受傷後失去記憶，但肇事的人出手相助。這位高手現在要賭一筆大的，一舉擊敗仇敵。', '大陸/賭神.jpg', 'https://www.youtube.com/watch?v=mYRH8e132ui-k', 0),
(133, '輝耀姬物語', '4', '輕煙裊裊的山崗上，伐竹老翁正在辛苦地砍竹，突然竹林間出現了一道神奇地光芒m老翁就近一看，竹桿竟如蓮花綻放開來，花蕊中端坐著一位可愛的小人兒。老翁小心翼翼地將她捧回家，小人兒居', '大陸/輝耀姬物語.jpg', 'https://www.youtube.com/watch?v=mYRH8e133ui-k', 3),
(134, '縱橫四海', '4', '法國巴黎博物館內，名畫《赫林之女僕》被人盜走。與此同時，阿海、阿占和紅豆三人以敏捷身手盜得另一幅名畫，在與法國大哥交易時得知名畫《赫林之女僕》在妖氣重重的古堡內，他們在曾江安', '大陸/縱橫四海.jpg', 'https://www.youtube.com/watch?v=mYRH8e134ui-k', 34),
(135, '霸王別姬', '4', '故事開始於1930年的北京，程蝶衣(張國榮飾)和段小樓(張豐毅飾)都是孤兒，從小就跟著同一個師父開始學戲。年齡稍長，到了決定他們專攻技藝項目時，程蝶衣被選擇當其中的「旦」角，段小樓則', '大陸/霸王別姬.jpg', 'https://www.youtube.com/watch?v=mYRH8e135ui-k', 6);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
